<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>
    <?php

    // $text = '<div class="flex-row"><h1 class="article__content-h1"> Китайская компания уволила сотрудника за медленный бег</h1></div><div class="flex-row"><p class="article__content-p">Увидел такую новость на просторах интернета. Больше всего она вирусится в беговых пабликах, например тут. Будучи любителем бега и юриспруденции, я не мог не проверить её достоверность. Все подробности этой истории ниже.</p></div><img src="" class="img__cover"><div class="flex-row"><h2 class="article__content-h2">Фейк или нет? </h2></div><div class="flex-row"><p class="article__content-p">Чтобы убедиться является ли новость реальной, я посетил сайт китайского суда. Оказалось, что на сайте Народного суда промежуточной инстанции Сучжоу (без VPN сайт недоступен) опубликован пресс-релиз по делу. История оказалась реальной. </p></div><img src="" class="img__cover"><div class="flex-row"><h2 class="article__content-h2">Фабула дела </h2></div><div class="flex-row"><p class="article__content-p">Вот подробности:
    // 18.06.2022 гражданин Лю Моу успешно прошел собеседование в компании по производству механических деталей. Также Лю прошел медицинское обследование (за свой счет) и передал результаты компании.
    // 22.06.2022 Лю подписал трудовой договор и был назначен в отдел ремонта оборудования. После сдачи экзамена по технике безопасности Лю должен был быть допущен к выполнению работы.
    // 25.06.2022 руководство сообщило Лю о необходимости принять участие в забеге на длинную дистанцию в соответствии с нормами и правилами компании, но не сообщило конкретный километраж.
    // Со слов Лю, когда он вышел на дистанцию, сотрудник службы безопасности рекомендовал сойти, если бежать станет невозможно. Лю утверждал, что пробежав 800 метров, понял, что рискует получить солнечный удар и завершил пробежку. После неудачного забега сотрудник отправился на рабочее место, но ему сообщили, что он не прошел испытательный срок. Лю Моу был уволен.
    // Лю с увольнением не согласился и обратился в суд с требованием о взыскании 6 700 юаней в качестве компенсации за незаконное увольнение, а также 300 юаней за три дня работы (в качестве зарплаты). </p></div>';

    // function setSrc($html, $value)
    // {
    //     for ($i = 0; $i < count($value); $i++) {
    //         $pos = strpos($html, $value[$i]);
    //         if ($pos !== false) {
    //             $html = str_replace("src=\"\"", '<img src="' . $value . '" class="img__cover>', $html);
    //         }
    //         return $html;
    //     }
    // }


//     $arr = [];
//     array_push($arr, '/images/uploadImages-3607.jpg');
//     array_push($arr, '/images/uploadImages-672839.jpeg');
//     array_push($arr, '/images/uploadImages-672839.jpeg');



//     // echo setSrc($text, $arr);
//     $arr = serialize($arr);
//     $arr = unserialize($arr);

// print_r($arr);



    ?>

</body>

</html>